# CallToolByIndex

## Description
Similar to CallTool. Takes the internal ID of a tool.

```pascal
FUNCTION CallToolByIndex(toolIndex : INTEGER) : BOOLEAN;
```

```python

def vs.CallToolByIndex(toolIndex):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|toolIndex|INTEGER||

## Version
Availability: from Vectorworks 2014
## Category
* Utility